print("-----Экранированные последовательности-----------------------------")
S = "s\np\ta\nbbb"
print(S)

print("\n-----Неформатированные строки (подавляют экранирование)-------------")
S2 = r"s\np\ta\nbbb"
print(S2)

S1 = "C:\temp\new"
print(S1)
S1 = r"C:\temp\new"
print(S1)

print("\n-------Строка байтов------------------------------------------------")
S = b"byte"
print(S)

print("\n-------Конкатенация (сложение строк)-------------------------------")
print(S1 + S2)

print("\n-------Повторение строки-------------------------------------------")
print(S1 * 3)
